Repository: alntestreg3/testrepo
Catalog: Etermax_Demo.*.po
Languages: de_de

source: OPEN YOUR WORLD TO BRAND-NEW CHALLENGES
de_de: ÖFFNEN SIE IHRE WELT FÜR BRANDNEUE CHALLENGES

source: Trivia Crack 2
de_de: Trivia 2

source: Collect characters
de_de: Sammle Charaktere

source: Create your Team
de_de: Erstelle dein Team

source: Play and exchange lives with your friends.
de_de: Spiele und tausche dein Leben mit deinen Freunden aus.

source: Reach new levels
de_de: Erreiche neue Level

source: Discover hundreds of exciting levels.
de_de: Entdecke hunderte aufregender Levels.

source: THRILLING GAME MODES
de_de: SPIELMODI

source: Tower Duel
de_de: Turmduell

source: Plan your strategy and defeat your opponent in every category
de_de: Planen Sie Ihre Strategie und besiegen Sie Ihren Gegner in jeder Kategorie

source: Daily Challenge
de_de: Tägliche Herausforderung

source: Achieve winning streaks and push yourself to the limit
de_de: Erreiche Siegesserie und drücke dich bis zum Limit

source: Classic Mode
de_de: Klassischer Modus

source: Play 1 on 1, get the six characters and clinch the win
de_de: Spielen Sie 1 gegen 1, holen Sie sich die sechs Charaktere und gewinnen Sie den Sieg
